АлогистикТест2/src/InformationRegisters/РФП_ИзмененияЗапрещены/РФП_ИзмененияЗапрещены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РФП_ИзмененияЗапрещены</name>
  <resources>
    <name>ИзмененияЗапрещены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/РФП_ИзмененияЗапрещены/ManagerModule.bsl
Процедура ИзменитьИзмененияЗапрещены(СсылкаНаОбъект, ИзмененияЗапрещены) Экспорт
	
	Если СсылкаНаОбъект.Пустая() Тогда
		возврат;
	КонецЕсли;
	
	ПравоИзмененияИзмененияЗапрещены = РольДоступна("РФП_УправлениеСостояниемИзмененияЗапрещены");
	
	Если НЕ ПравоИзмененияИзмененияЗапрещены Тогда
		возврат;
	КонецЕсли;
	
	
	Рег = РегистрыСведений.РФП_ИзмененияЗапрещены.СоздатьНаборЗаписей();
	Рег.Отбор.Объект.Установить(СсылкаНаОбъект);
	Рег.Прочитать();
	Если Рег.Количество() = 0 Тогда
		Зап = Рег.Добавить();
		Зап.Объект = СсылкаНаОбъект;
	Иначе
		Зап = Рег[0];
	КонецЕсли;
	Зап.ИзмененияЗапрещены = ИзмененияЗапрещены;
	Рег.Записать();
		
КонецПроцедуры

	
	
Функция ПолучитьСостояниеИзмененияЗапрещены(СсылкаНаОбъект) Экспорт
	
	Если СсылкаНаОбъект.Пустая() Тогда
		возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РФП_ИзмененияЗапрещены.ИзмененияЗапрещены
		|ИЗ
		|	РегистрСведений.РФП_ИзмененияЗапрещены КАК РФП_ИзмененияЗапрещены
		|ГДЕ
		|	РФП_ИзмененияЗапрещены.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ИзмененияЗапрещены;
	КонецЕсли;
	
	возврат Ложь;
КонецФункции
